linux/order/pipe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-15 五 21:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pipe</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rzry https://github.com/rzry" />
<link rel='stylesheet' type='text/css' href='http://zxxky.cn/1.css'/>
</head>
<body>
<div id="content">
<h1 class="title">pipe</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org729e512">1. I/O 流</a>
<ul>
<li><a href="#org75e8cfb">1.1. 基本</a></li>
<li><a href="#orgc6e98fe">1.2. 重定向</a>
<ul>
<li><a href="#org1847a16">1.2.1. &gt;</a></li>
<li><a href="#org1b382b4">1.2.2. &gt;&gt;</a></li>
</ul>
</li>
<li><a href="#orgc367b39">1.3. 管道</a>
<ul>
<li><a href="#org1a51461">1.3.1. |</a></li>
</ul>
</li>
<li><a href="#org07a7aa8">1.4. Path</a></li>
</ul>
</li>
<li><a href="#org764a4d4">2. 番外</a></li>
</ul>
</div>
</div>

<div id="outline-container-org729e512" class="outline-2">
<h2 id="org729e512"><span class="section-number-2">1</span> I/O 流</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org75e8cfb" class="outline-3">
<h3 id="org75e8cfb"><span class="section-number-3">1.1</span> 基本</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
stdin(键盘)、 stdout(屏幕)和 stderr(错误消息输出到屏幕上)
</pre>
</div>
</div>

<div id="outline-container-orgc6e98fe" class="outline-3">
<h3 id="orgc6e98fe"><span class="section-number-3">1.2</span> 重定向</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org1847a16" class="outline-4">
<h4 id="org1847a16"><span class="section-number-4">1.2.1</span> &gt;</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><p>
存在就覆盖 , 否则就创建
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #6f7787;">#</span><span style="color: #6f7787;">&#20363;&#22914;&#24819;&#21543;ls -al &#30340;&#36755;&#20986; &#37325;&#23450;&#21521;&#21040;&#19968;&#20010;&#25991;&#20214;</span>
ls -al &gt; ls.log
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org1b382b4" class="outline-4">
<h4 id="org1b382b4"><span class="section-number-4">1.2.2</span> &gt;&gt;</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>存在就追加 , 否则就创建</li>
<li>同&gt;使用方法.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc367b39" class="outline-3">
<h3 id="orgc367b39"><span class="section-number-3">1.3</span> 管道</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org1a51461" class="outline-4">
<h4 id="org1a51461"><span class="section-number-4">1.3.1</span> |</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>左边的输出 当做 右边的输入</li>
<li>所有有多个命令 和 | 组成 搭配 grep  xargs 等</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #6f7787;">#</span><span style="color: #6f7787;">&#19968;&#20010;&#20960;&#20046;&#25645;&#37197;&#25152;&#26377;&#25351;&#20196;&#30340;&#25805;&#20316;</span>
ls -al | grep emacs
<span style="color: #6f7787;"># </span><span style="color: #6f7787;">&#25628;&#32034;&#24403;&#21069;&#30446;&#24405;&#19979;&#21253;&#21547;emacs &#30340;&#25991;&#20214;</span>
<span style="color: #6f7787;"># </span><span style="color: #6f7787;">&#21487;&#20197;&#25645;&#37197; &#36890;&#37197;&#31526;&#26469;&#20351;&#29992;</span>
<span style="color: #6f7787;"># </span><span style="color: #6f7787;">ls -l | more  &#31867;&#20284;&#19982;&#19979;&#25991;&#20195;&#30721;</span>
<span style="color: #6f7787;">#</span><span style="color: #6f7787;">more &#21629;&#20196;&#23558; ls -l &#30340;&#36755;&#20986;&#20316;&#20026;&#20854;&#36755;&#20837;&#12290;&#36825;&#20010;&#21629;&#20196;&#30340;&#25928;&#26524;&#26159; ls -l &#30340;&#36755;&#20986;&#19968;&#27425;&#26174;&#31034;&#19968;&#20010;&#23631;&#24149;&#12290;</span>
<span style="color: #6f7787;">#</span><span style="color: #6f7787;">&#31649;&#36947;&#20316;&#20026;&#19968;&#20010;&#23481;&#22120;&#65292;&#25509;&#21463; ls-l &#30340;&#36755;&#20986;&#65292;&#24182;&#23558;&#20854;&#20316;&#20026;&#36755;&#20837;&#25552;&#20379;&#32473; more</span>
<span style="color: #6f7787;">#</span><span style="color: #6f7787;">&#27492;&#21629;&#20196;&#19981;&#20351;&#29992;&#30913;&#30424;&#23558; ls-l &#30340;&#26631;&#20934;&#36755;&#20986;&#36830;&#25509;&#21040; more &#30340;&#26631;&#20934;&#36755;&#20837;</span>
<span style="color: #6f7787;">#</span><span style="color: #6f7787;">&#22240;&#20026;&#31649;&#36947;&#26159;&#22312;&#20027;&#23384;&#20648;&#22120;&#20013;&#23454;&#29616;&#30340;</span>
 ls -l &gt; temp
 more &lt; temp (or more temp)
 [contents of temp]
 rm temp
 <span style="color: #6f7787;">#</span><span style="color: #6f7787;">&#25490;&#24207; &#20570;&#20026;&#36755;&#20837; &#36755;&#20986;&#25991;&#20214;&#20013;&#21807;&#19968;&#20540;</span>
 sort 1.txt | uniq
</pre>
</div>
<ul class="org-ul">
<li>管道是单向的，即从左到右通过管道的数据流</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org07a7aa8" class="outline-3">
<h3 id="org07a7aa8"><span class="section-number-3">1.4</span> Path</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
eg : echo "hello xxx"
echo 是可执行文件 , 位于bin 下面
echo $PATH   可以打印出你的path 包含的路径(可以是相对)
只要 echo 这个文件在bin 下 bin 在path 中 那么就可以执行
不用再 /bin/echo
按顺序遍历冒号分隔的路径，直到找到可执行文件
因此，如果两个路径包含所需的可执行文件，Unix 将使用第一个路径
我们使用 export 命令向 PATH 变量添加一个新路径(临时的,可以放在你的.bashrc)
不同的shell(zsh , bash),只有交互式才可以读取这种配置(这个得说一天)
</pre>
</div>
</div>
</div>

<div id="outline-container-org764a4d4" class="outline-2">
<h2 id="org764a4d4"><span class="section-number-2">2</span> 番外</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
1 . ls -al 输出结果
   -代表是文件
   d 代表目录
   l 代表链接
   b 代表特殊设备
   drwx____ 代表文件标示和权限
2 . 权限  r = 4 , w = 2 , x = 1(8进制)
   重复的 rwx 序列表示读(r)、写(w)和执行(x)权限的概念，
   用于用户、组和其他(按此顺序)
   -rw-rw-r--  一个普通的文件，用户和组都可以读写，但是只有其他人可以读。
3 . touch 一个 文件 会有默认权限 是通过umask 来设置的
    ubuntu 普通用户 和 root  对于这个值 是不同的
4 . .. 再补吧

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-01-15</p>
<p class="author">Author: rzry <a href="https://github.com/rzry">https://github.com/rzry</a></p>
<p class="date">Created: 2021-01-15 五 21:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
